{
    "Living area (sq ft)": "Above-grade finished square footage; typically the strongest driver of price.",
    "Lot size": "Total land area; larger lots often command premiums, especially in low-density areas.",
    "Bedrooms": "Count and size of bedrooms; optimal count depends on local buyer norms.",
    "Bathrooms": "Number of full/half baths; “total baths” and presence of ensuite primary bath matter.",
    "Age / Year built": "Newer homes usually price higher; vintage premiums possible if well-maintained.",
    "Renovation year": "Recent remodels (kitchen, baths, major systems) reduce buyer perceived future costs.",
    "Overall quality/condition": "Appraiser-style ratings of materials, workmanship, and upkeep.",
    "Floor plan/layout": "Functional flow, open plan, dedicated office, primary suite configuration.",
    "Finished basement area": "Additional livable space (where customary); egress and ceiling height influence value.",
    "Garage spaces": "Enclosed parking count and quality (attached > detached in many markets).",
    "Parking type": "Driveway, covered carport, on-street availability affects utility and appeal.",
    "Kitchen quality": "Cabinetry, counters, appliances; modern, neutral finishes boost perceived value.",
    "Bathroom quality": "Tile, fixtures, double vanities, walk-in shower/tub; primary bath upgrades are high impact.",
    "Flooring": "Durable, cohesive surfaces (hardwood/LVP/tile) vs. worn carpet.",
    "Roof age/material": "Remaining life and material (e.g., architectural shingles, metal) factor into buyer risk.",
    "HVAC": "Age/efficiency of heating/cooling; central A/C is a must-have in many regions.",
    "Windows/insulation": "Double-pane, low-E, good insulation reduce energy bills and noise.",
    "Energy rating": "Certifications/scores (ENERGY STAR, HERS/Home Energy Score) tied to lower operating costs.",
    "Solar panels": "Owned systems add value more reliably than leased PPAs.",
    "Smart home features": "Thermostats, security, lighting that improve convenience/efficiency.",
    "Curb appeal": "Exterior condition, landscaping, entryway; drives first impressions and foot traffic.",
    "Staging/presentation": "Decluttered, well-staged homes sell faster and can secure higher offers.",
    "Outdoor spaces": "Usable yards, decks/patios, outdoor kitchens, shade structures.",
    "Natural light/orientation": "Bright interiors, good aspect, window placement.",
    "Views/waterfront": "Sightlines to mountains, water, greenbelt; private outlook premiums.",
    "Noise/exposure": "Proximity to busy roads, flight paths, industrial uses can discount price.",
    "School quality": "Assigned school ratings and boundaries materially affect demand in family-oriented areas.",
    "Walkability/transit": "Walk Score, proximity to transit, shops, parks; convenience premiums.",
    "Neighborhood amenities": "Community pools, trails, gyms, retail nodes nearby.",
    "Street setting": "Cul-de-sac vs. arterial, traffic volume, sidewalk presence.",
    "HOA fees/rules": "Monthly cost and restrictions (rent caps, exterior rules) influence buyer pool.",
    "Insurance costs/availability": "Market reality in high-risk zones (wind/hail, wildfire, coastal).",
    "Flood risk": "FEMA zone, elevation, prior claims; impacts insurance and lender requirements.",
    "Wildfire risk": "Defensible space, materials, local hazard scores affect pricing in fire-prone regions.",
    "Wind/hurricane risk": "Building codes (roof tie-downs, impact windows) and claim history matter.",
    "Property taxes": "Effective tax rate and recent reassessments influence affordability.",
    "Zoning/expandability": "Ability to add ADU, finish attic, or expand footprint adds option value.",
    "Internet/fiber": "High-speed connectivity increasingly a must-have for remote work.",
    "Market comps & supply": "Recent comparable sales, days on market, and inventory set pricing context."
}
